In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
n = np.nan

In [3]:
type(n)

float

In [4]:
n

nan

In [5]:
m=1
m += n

In [6]:
n

nan

# nan in series

In [8]:
s1 = pd.Series([1,2,np.nan,4,5],index=['A','B','C','D','E'])

In [9]:
s1

A    1.0
B    2.0
C    NaN
D    4.0
E    5.0
dtype: float64

In [11]:
type(s1.isna())

pandas.core.series.Series

In [12]:
s1.notna()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [13]:
s1.dropna()

A    1.0
B    2.0
D    4.0
E    5.0
dtype: float64

# nan in dataframe

In [15]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [16]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [17]:
dframe.notna()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [24]:
df1 = dframe.dropna(axis=0,how='all')

In [25]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [43]:
df2 = dframe.dropna(thresh=2)

In [44]:
df2

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

# dframe.dropna(thresh=2) Nan数量大于2的行删除

In [47]:
dframe.fillna(value={0:0,1:1,2:2,3:3})

     0    1    2
0  1.0  2.0  3.0
1  0.0  5.0  6.0
2  7.0  1.0  9.0
3  0.0  1.0  2.0

In [48]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [49]:
df1.dropna()

     0    1    2
0  1.0  2.0  3.0

In [50]:
df1.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  9.0

In [51]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

# dropna fillna 不会修改原本的数据